cf_billing/Catalogs/энргШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиНачисленияПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяГлубинаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьНаТекущуюДату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргАбоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агентский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домовладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальноеОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМуниципальноеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнутрРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГород</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПрописки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыАбонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНасПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРайонАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУлица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPабонент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЕИРЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргШаблоныСообщений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗначенияПараметров(Знач ТекЗадачи = Неопределено, Знач Абоненты = Неопределено, Знач БезЗаполнения = Ложь) Экспорт 
	Результат = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(энргКонтрагенты.бестФамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(энргКонтрагенты.бестИмя, """") КАК Имя,
		|	ЕСТЬNULL(энргКонтрагенты.бестОтчество, """") КАК Отчество,
		|	ЕСТЬNULL(энргЗадачаПИД.АдресОбъекта, энргАбонентыКонтактнаяИнформация.Представление) КАК АдресОбъекта,
		|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
		|	энргЗадачаПИД.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВЫБОР
		|		КОГДА энргЗадачаПИД.ДатаСледЭтапа ЕСТЬ NULL
		|			ТОГДА NULL
		|		КОГДА энргЗадачаПИД.ДатаСледЭтапа = энргЗадачаПИД.Дата
		|			ТОГДА ДОБАВИТЬКДАТЕ(энргЗадачаПИД.Дата, МЕСЯЦ, 1)
		|		ИНАЧЕ энргЗадачаПИД.ДатаСледЭтапа
		|	КОНЕЦ КАК ДатаСледЭтапа,
		|	Организации.ИНН КАК ИНН,
		|	БанковскиеСчета.НомерСчета КАК РасчСчет,
		|	БанковскиеСчета.Банк.Наименование КАК Банк,
		|	Банки.Код КАК БИК,
		|	Банки.КоррСчет КАК КоррСчет,
		|	энргАбоненты.ВидОбъекта.Наименование КАК ВидОбъекта,
		|	энргАбоненты.Ссылка КАК Абонент,
		|	энргКлючиПомещений.Строение КАК МКД,
		|	ЕСТЬNULL(энргЗадачаПИД.Район.Наименование, энргАбоненты.Район.Наименование) КАК Район,
		|	ЕСТЬNULL(энргЗадачаПИД.Район, энргАбоненты.Район) КАК РайонСсылка,
		|	Организации.Наименование КАК Организация,
		|	энргЗадачаПИД.Дата КАК Дата,
		|	энргЗадачаПИД.Ссылка КАК Задача,
		|	Организации.Ссылка КАК ОрганизацияСсылка,
		|	энргАбоненты.КоличествоДнейОтсрочки КАК КоличествоДнейОтсрочки,
		|	ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка) КАК Договор
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО энргАбоненты.Ссылка = энргЗадачаПИД.Абонент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|		ПО энргАбоненты.ФизЛицо = энргКонтрагенты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|				ПО БанковскиеСчета.Банк = Банки.Ссылка
		|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
		|		ПО (ЕСТЬNULL(энргЗадачаПИД.Организация, энргАбоненты.Организация) = Организации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|		ПО энргАбоненты.Ссылка = энргАбонентыКонтактнаяИнформация.Ссылка
		|			И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	(энргАбоненты.Ссылка В (&Абоненты)
		|			ИЛИ энргЗадачаПИД.Ссылка В (&Задачи))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(энргКонтрагенты.бестФамилия, """"),
		|	ЕСТЬNULL(энргКонтрагенты.бестИмя, """"),
		|	ЕСТЬNULL(энргКонтрагенты.бестОтчество, """"),
		|	ЕСТЬNULL(энргКонтрагентыКонтактнаяИнформация.Представление, """"),
		|	NULL,
		|	энргЗадачаПИД.СуммаЗадолженности,
		|	ВЫБОР
		|		КОГДА энргЗадачаПИД.ДатаСледЭтапа ЕСТЬ NULL
		|			ТОГДА NULL
		|		КОГДА энргЗадачаПИД.ДатаСледЭтапа = энргЗадачаПИД.Дата
		|			ТОГДА ДОБАВИТЬКДАТЕ(энргЗадачаПИД.Дата, МЕСЯЦ, 1)
		|		ИНАЧЕ энргЗадачаПИД.ДатаСледЭтапа
		|	КОНЕЦ,
		|	Организации.ИНН,
		|	БанковскиеСчета.НомерСчета,
		|	БанковскиеСчета.Банк.Наименование,
		|	Банки.Код,
		|	Банки.КоррСчет,
		|	NULL,
		|	ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка),
		|	NULL,
		|	ЕСТЬNULL(энргЗадачаПИД.Район.Наименование, ДоговорыКонтрагентов.Район.Наименование),
		|	ЕСТЬNULL(энргЗадачаПИД.Район, ДоговорыКонтрагентов.Район),
		|	Организации.Наименование,
		|	энргЗадачаПИД.Дата,
		|	энргЗадачаПИД.Ссылка,
		|	Организации.Ссылка,
		|	0,
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.энргДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО ДоговорыКонтрагентов.Ссылка = энргЗадачаПИД.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
		|			ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация.Ссылка
		|				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
		|		ПО ДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|				ПО БанковскиеСчета.Банк = Банки.Ссылка
		|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
		|		ПО (ЕСТЬNULL(энргЗадачаПИД.Организация, ДоговорыКонтрагентов.Организация) = Организации.Ссылка)
		|ГДЕ
		|	(ДоговорыКонтрагентов.Ссылка В (&Абоненты)
		|			ИЛИ энргЗадачаПИД.Ссылка В (&Задачи))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	МАКСИМУМ(энргНастройкиНачисленияПени.Период) КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка) КАК Договор
		|ПОМЕСТИТЬ ВТ_НепогашеныеНачисления
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&ТекДата,
		|			(Организация, Район, МКД, Абонент) В
		|				(ВЫБРАТЬ
		|					ВТ_ОсновныеДанные.ОрганизацияСсылка КАК ОрганизацияСсылка,
		|					ВТ_ОсновныеДанные.РайонСсылка КАК РайонСсылка,
		|					ВТ_ОсновныеДанные.МКД КАК МКД,
		|					ВТ_ОсновныеДанные.Абонент КАК Абонент
		|				ИЗ
		|					ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)) КАК энргВзаиморасчетыПоМесяцамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиНачисленияПени КАК энргНастройкиНачисленияПени
		|		ПО энргВзаиморасчетыПоМесяцамОстатки.Организация = энргНастройкиНачисленияПени.Организация
		|			И энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления >= энргНастройкиНачисленияПени.Период
		|			И энргВзаиморасчетыПоМесяцамОстатки.Район = энргНастройкиНачисленияПени.Район
		|ГДЕ
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_НепогашеныеНачисления.Организация КАК Организация,
		|	ВТ_НепогашеныеНачисления.Район КАК Район,
		|	ВТ_НепогашеныеНачисления.Абонент КАК Абонент,
		|	МИНИМУМ(ВТ_НепогашеныеНачисления.ПериодНачисления) КАК НачалоДолга,
		|	СУММА(ВТ_НепогашеныеНачисления.СуммаОстаток) КАК Долг,
		|	МАКСИМУМ(ВТ_НепогашеныеНачисления.ПериодНачисления) КАК ОкончаниеДолга,
		|	ВТ_НепогашеныеНачисления.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Долг
		|ИЗ
		|	ВТ_НепогашеныеНачисления КАК ВТ_НепогашеныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиНачисленияПени КАК энргНастройкиНачисленияПени
		|		ПО ВТ_НепогашеныеНачисления.Организация = энргНастройкиНачисленияПени.Организация
		|			И ВТ_НепогашеныеНачисления.Район = энргНастройкиНачисленияПени.Район
		|			И ВТ_НепогашеныеНачисления.Период = энргНастройкиНачисленияПени.Период
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВТ_НепогашеныеНачисления.ПериодНачисления, МЕСЯЦ), СЕКУНДА, 3600 * 24 * ЕСТЬNULL(энргНастройкиНачисленияПени.КрайнийСрокОплаты - 1, 0)) <= &ТекДата
		|	И ВТ_НепогашеныеНачисления.Абонент <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НепогашеныеНачисления.Организация,
		|	ВТ_НепогашеныеНачисления.Район,
		|	ВТ_НепогашеныеНачисления.Абонент,
		|	ВТ_НепогашеныеНачисления.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.ОрганизацияСсылка КАК Организация,
		|	ВТ_ОсновныеДанные.РайонСсылка КАК Район,
		|	ВТ_ОсновныеДанные.МКД КАК МКД,
		|	ВТ_ОсновныеДанные.Абонент КАК Абонент,
		|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ОсновныеДанные.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_ПараметрыЗадолженностиПИР
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|		ПО ВТ_ОсновныеДанные.Задача = энргЗадачаПИДЗадолженность.Ссылка
		|ГДЕ
		|	НЕ ВТ_ОсновныеДанные.Задача ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПараметрыЗадолженностиПИР.Организация КАК Организация,
		|	ВТ_ПараметрыЗадолженностиПИР.Район КАК Район,
		|	ВТ_ПараметрыЗадолженностиПИР.Абонент КАК Абонент,
		|	МИНИМУМ(ВТ_ПараметрыЗадолженностиПИР.ПериодНачисления) КАК НачалоДолгаПИР,
		|	СУММА(ВТ_НепогашеныеНачисления.СуммаОстаток) КАК ДолгПИР,
		|	МАКСИМУМ(ВТ_ПараметрыЗадолженностиПИР.ПериодНачисления) КАК ОкончаниеДолгаПИР,
		|	ВТ_ПараметрыЗадолженностиПИР.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_ДолгПИР
		|ИЗ
		|	ВТ_ПараметрыЗадолженностиПИР КАК ВТ_ПараметрыЗадолженностиПИР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НепогашеныеНачисления КАК ВТ_НепогашеныеНачисления
		|		ПО ВТ_ПараметрыЗадолженностиПИР.Организация = ВТ_НепогашеныеНачисления.Организация
		|			И ВТ_ПараметрыЗадолженностиПИР.Район = ВТ_НепогашеныеНачисления.Район
		|			И ВТ_ПараметрыЗадолженностиПИР.Абонент = ВТ_НепогашеныеНачисления.Абонент
		|			И ВТ_ПараметрыЗадолженностиПИР.Услуга = ВТ_НепогашеныеНачисления.Услуга
		|			И ВТ_ПараметрыЗадолженностиПИР.ПериодНачисления = ВТ_НепогашеныеНачисления.ПериодНачисления
		|			И ВТ_ПараметрыЗадолженностиПИР.Договор = ВТ_НепогашеныеНачисления.Договор
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПараметрыЗадолженностиПИР.Организация,
		|	ВТ_ПараметрыЗадолженностиПИР.Район,
		|	ВТ_ПараметрыЗадолженностиПИР.Абонент,
		|	ВТ_ПараметрыЗадолженностиПИР.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Фамилия КАК Фамилия,
		|	ВТ_ОсновныеДанные.Имя КАК Имя,
		|	ВТ_ОсновныеДанные.Отчество КАК Отчество,
		|	ВТ_ОсновныеДанные.АдресОбъекта КАК АдресОбъекта,
		|	ВТ_ОсновныеДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_ОсновныеДанные.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	ВТ_ОсновныеДанные.ИНН КАК ИНН,
		|	ВТ_ОсновныеДанные.РасчСчет КАК РасчСчет,
		|	ВТ_ОсновныеДанные.Банк КАК Банк,
		|	ВТ_ОсновныеДанные.БИК КАК БИК,
		|	ВТ_ОсновныеДанные.КоррСчет КАК КоррСчет,
		|	ВТ_ОсновныеДанные.ВидОбъекта КАК ВидОбъекта,
		|	ВТ_ОсновныеДанные.Абонент КАК Абонент,
		|	ВТ_ОсновныеДанные.МКД КАК МКД,
		|	ВТ_ОсновныеДанные.Район КАК Район,
		|	ВТ_ОсновныеДанные.Организация КАК Организация,
		|	ВТ_ОсновныеДанные.Дата КАК Дата,
		|	ВТ_ОсновныеДанные.Задача КАК Задача,
		|	ЕСТЬNULL(ВТ_Долг.Долг, 0) КАК Долг,
		|	ЕСТЬNULL(ВТ_Долг.НачалоДолга, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоДолга,
		|	ЕСТЬNULL(ВТ_Долг.ОкончаниеДолга, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеДолга,
		|	ЕСТЬNULL(ВТ_ДолгПИР.ДолгПИР, 0) КАК ДолгПИР,
		|	ЕСТЬNULL(ВТ_ДолгПИР.НачалоДолгаПИР, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоДолгаПИР,
		|	ЕСТЬNULL(ВТ_ДолгПИР.ОкончаниеДолгаПИР, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеДолгаПИР
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Долг КАК ВТ_Долг
		|		ПО ВТ_ОсновныеДанные.ОрганизацияСсылка = ВТ_Долг.Организация
		|			И ВТ_ОсновныеДанные.РайонСсылка = ВТ_Долг.Район
		|			И ВТ_ОсновныеДанные.Абонент = ВТ_Долг.Абонент
		|			И ВТ_ОсновныеДанные.Договор = ВТ_Долг.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДолгПИР КАК ВТ_ДолгПИР
		|		ПО ВТ_ОсновныеДанные.ОрганизацияСсылка = ВТ_ДолгПИР.Организация
		|			И ВТ_ОсновныеДанные.РайонСсылка = ВТ_ДолгПИР.Район
		|			И ВТ_ОсновныеДанные.Абонент = ВТ_ДолгПИР.Абонент
		|			И ВТ_ОсновныеДанные.Договор = ВТ_ДолгПИР.Договор";
	
	Запрос.УстановитьПараметр("Задачи",   ТекЗадачи);
	Запрос.УстановитьПараметр("Абоненты", Абоненты);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	СтрокаСтрук = "ФИО";
	Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
		СтрокаСтрук = СтрокаСтрук + ", " + ТекКолонка.Имя;
	КонецЦикла;
	
	Если БезЗаполнения Тогда
		ТекСтрока = Новый Структура(СтрокаСтрук);
		Возврат ТекСтрока;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекСтрока = Новый Структура(СтрокаСтрук);
		ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
		ТекСтрока.НачалоДолга		 = Формат(Выборка.НачалоДолга, "ДФ=dd.MM.yyyy");
		ТекСтрока.ОкончаниеДолга  	 = Формат(Выборка.ОкончаниеДолга, "ДФ=dd.MM.yyyy");
		ТекСтрока.НачалоДолгаПИР 	 = Формат(Выборка.НачалоДолга, "ДФ=dd.MM.yyyy");
		ТекСтрока.ОкончаниеДолгаПИР  = Формат(Выборка.ОкончаниеДолга, "ДФ=dd.MM.yyyy");
		ТекСтрока.ДатаСледЭтапа		 = Формат(Выборка.ДатаСледЭтапа, "ДФ=dd.MM.yyyy");
		ТекСтрока.Дата				 = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ТекСтрока.ФИО				 = Выборка.Фамилия + ?(ЗначениеЗаполнено(Выборка.Имя), " " + Лев(Выборка.Имя, 1) + ".", "")
												+ ?(ЗначениеЗаполнено(Выборка.Отчество), " " + Лев(Выборка.Отчество, 1) + ".", "");
		Результат.Добавить(ТекСтрока);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСписокПараметровИзШаблона(ТекстШаблона) Экспорт 
	Результат = Новый Массив;
	
	ВсеПараметры = ПолучитьЗначенияПараметров(,, Истина);
	Для каждого ТекПарам Из ВсеПараметры Цикл
	 	Если СтрНайти(ТекстШаблона, "@" + ТекПарам.Ключ + "@") <> 0 Тогда
			Результат.Добавить(ТекПарам.Ключ);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции 

Функция ЗаполнитьПараметрыШаблона(ТекстШаблона, ЗначенияПараметров, СписокПарам = Неопределено) Экспорт 
	Перем ЗначениеПараметра;
	
	Результат = ТекстШаблона;
	
	Если Не ЗначениеЗаполнено(ТекстШаблона) Или ТипЗнч(ЗначенияПараметров) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;

	Если СписокПарам = Неопределено Тогда
		ВсеПарам = ПолучитьЗначенияПараметров(,, Истина);
		
		СписокПарам = Новый Массив;
		Для каждого ТекПарам Из ВсеПарам Цикл
			СписокПарам.Добавить(ТекПарам.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого ИмяПараметра Из СписокПарам Цикл
		Если ЗначенияПараметров.Свойство(ИмяПараметра, ЗначениеПараметра) Тогда
			ЗначениеПараметра = ?(ТипЗнч(ЗначениеПараметра) = Тип("Строка"), СокрЛП(ЗначениеПараметра), Строка(ЗначениеПараметра));
		Иначе
			ЗначениеПараметра = "";
		КонецЕсли;
		Результат = СтрЗаменить(Результат, "@" + ИмяПараметра + "@", ЗначениеПараметра);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#Область РаботаСФормой

Процедура ДобавлениеКомандПараметров(ЭтаФорма, ИмяГруппыКоманд = "КомандыПараметрыШаблона", ПрефиксКоманд = "КомандаПарам", ДействиеКоманды = "ВставитьПараметр") Экспорт 
	
	СтрукПарам = Справочники.энргШаблоныСообщений.ПолучитьЗначенияПараметров(,, Истина);
	СписокЗнач = Новый СписокЗначений;
	Для каждого ТекПарам Из СтрукПарам Цикл
		СписокЗнач.Добавить(ТекПарам.Ключ);
	КонецЦикла;
	СписокЗнач.СортироватьПоЗначению();
	
	Для каждого ТекПарам Из СписокЗнач Цикл
		// Добавление команды
		ИмяКмд = ПрефиксКоманд + ТекПарам.Значение;
		
		Кмд = ЭтаФорма.Команды.Добавить(ИмяКмд);
		Кмд.Действие				  = ДействиеКоманды;
		Кмд.Заголовок				  = "@" + ТекПарам.Значение + "@";
		Кмд.ИзменяетСохраняемыеДанные = Истина;
		
		// Добавление новой кнопки
		ЭлементКМД = ЭтаФорма.Элементы.Добавить(ИмяКмд, Тип("КнопкаФормы"), ЭтаФорма.Элементы[ИмяГруппыКоманд]);
		ЭлементКМД.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка;
		ЭлементКМД.ИмяКоманды	= ИмяКмд;
	КонецЦикла;
	
КонецПроцедуры
	
Функция ЗаменаКоманды(ИмяКоманды, Префикс) Экспорт
	Возврат "@" + Сред(ИмяКоманды, СтрДлина(Префикс)+1) + "@";
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
